{
    "registration": {
        "description": "Registration of participants will begin on Monday April 25th, from 8:00 am in the entrance hall.",
        "icon": "registration",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fregistration.jpg?alt=media&token=27328646-d323-4cca-904c-75f021bc3ffe",
        "title": "Gates open / Registration",
        "tags": [
          "Service"
        ]
    },
    "lunch": {
        "description": "Fooooood! 🥪\nThe best time to talk with speakers and attendees",
        "icon": "lunch",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Flunch.jpg?alt=media&token=bc82aaff-92cc-4dcc-a00e-2b6f30a40225",
        "title": "Lunch",
        "tags": [
          "Service"
        ]
    },
    "break": {
        "description": "Coffeeeeeee! ☕️",
        "icon": "coffee-break",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fcoffee-break.jpg?alt=media&token=7c2c929b-cb94-4be8-a05a-b3f678136cb7",
        "title": "Coffee break",
        "tags": [
          "Service"
        ]
    },
    "party": {
        "description": "Let’s talk and drink! 🎉 From 19:00, come for chat, networking, drinks and food! 😎<br>The Makers Party will be held in \"Café Oz Denfert\"<br>This is a large venue with australian beers and bar meals just at 10 minutes in transport from the conference venue, at Denfert Rochereau<br><br><h2>Directions</h2>Address: 3 Place Denfert-Rochereau, 75014 Paris<br>M ° Denfert-Rochereau, M ° Raspail (lines 4, 6)<br>Just take the Metro 4 to Denfert<br>https://goo.gl/maps/sC5kxJrWfhQ2<br><br><h2>Infos</h2>The locker room will be free from 19h to 21h.<br>First 200 beers will be free 🍻 And there will be food boards to share",
        "icon": "party",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fparty.jpg?alt=media&token=8e413f01-373a-40bf-bb87-1dcf1d8e6af1",
        "title": "Makers Party! 🎉",
        "tags": [
          "Service"
        ]
    },
    "opening": {
        "description": "Come early and choose the best seat",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
        "title": "Opening",
        "tags": [
          "Service"
        ]
    },
    "surprise": {
        "description": "More information to come.\n\nThank you and see you next year! 👋",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
        "title": "Surprise and thank you!",
        "tags": [
          "Service"
        ]
    },
    "closing": {
        "description": "Thank you and see you next year! 👋",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
        "title": "Thank you!",
        "tags": [
          "Service"
        ]
    },
    "DIA-1089": {
        "complexity": "Beginner",
        "speakers": [
            "37f10fced5aa69b828135567a03a2aaed66621d0",
            "fb805760b311d7dea7963afcd97f9613303f7722",
            "d2a0ee8397721dab722a6f969532df215dad171c",
            "7efc198c67dc2f4c71df042e3a7e7d16c601c976",
            "370e6c635f61bb5c39e82f411e8a639d0fdaf7ce"
        ],
        "description": "Have you ever wondered how things were in other companies? How is your concurrent team organized, what is their Android team size? Wait, team can grow and still make contribution easy? Or are you looking for tips or small improvements to create a better working environment? Joining a new team? Interested in knowing a concrete plan to address code debt? What were the worst project/decision x or y were part of?\n\nWonder no more 💡 During this roundtable, I, Marion Hayoun [Dashlane] -your facilitator- will ask all those questions to Anita Singh [Gorillas], Sandra Dupré [Disney streaming services] and Syrine Trabelsi [Trainline].\n\nBe ready to take notes and bring back homework :)",
        "language": "English",
        "title": "Roundtable: process for your Android team",
        "tags": [
            "Android Development"
        ]
    },
    "PBU-0425": {
        "title": "App Clinic",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "A bunch of Android experts will come on stage, discovering a few applications in live, they will provide feedback and advices to the developers.\n\nPropose your application for the review by sending the Play Store link or the APK to app.clinic@androidmakers.fr",
        "complexity": "Beginner",
        "speakers": [
            "d2a0ee8397721dab722a6f969532df215dad171c",
            "9c664410ea429bd31e4103fb1eb6e2bbe7b7f34f",
            "a14457ee24a86a604c55d6774bed5483b630e78f",
            "2a2a587770ac71e14bdc82a6115575632f3401e0",
            "5978cd774e924d51f2923d8620f1346a3392263c",
            "4227e79e90c24f18fa5d21d0f583b1ee263216bd"
        ]
    },
    "KDO-9985": {
        "title": "Creating a UI Toolkit From Scratch",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "UI Toolkits like Jetpack Compose are complex beasts that can be quite intimidating from the outside. In this session we will demystify UI Toolkits by building one from scratch for Android. You will understand the core responsibilities of a UI Toolkit and how they interact with their host Operating System. The project used as an example is designed to be different from both Views and Jetpack Compose.",
        "complexity": "Intermediate",
        "speakers": [
            "4a7ca4c16cbe81a612bf3011a3d3439f85408103",
            "379c162aac12eca2deca690287b54ad270cc2e40"
        ]
    },
    "DFV-7878": {
        "title": "Let the IDE do that for you",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Android developers are very lucky: there is a world-class IDE, Android Studio, that we can use to write our apps. Compared to what's available on other platforms, we're absolutely spoiled. And yet, most folks only scratch the surface of what the IDE can do for us. There's a gazillion features, plugins, and tricks that make life much easier, just waiting to be discovered.\n\nWith our faithful companion, the Find Action tool, we'll explore what lies beneath the surface and learn many cool tricks in this live-coded session (what could possibly go wrong?) to save time and avoid repetitive tasks, improve pairing, and our code. You'll walk away with a bag of tips to improve your productivity and with the mindset to exploit all the features of IntelliJ-based IDEs such as Android Studio.",
        "complexity": "Beginner",
        "speakers": [
            "4227e79e90c24f18fa5d21d0f583b1ee263216bd"
        ]
    },
    "VFF-1339": {
        "title": "Invest in Real State: A workshop for State in Compose",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "All applications handle state: whether it is your list of bookmarked items or the products in your shopping cart, your application needs to be able to request information, process it, and display the UI according to the current state. It should also handle updates of this state, which can happen from different sources. With Compose, handling state doesn’t have to be difficult! In this workshop you’ll learn hands-on how the unidirectional data flow works, how to manage state and work with APIs like remember, rememberSaveable and mutableStateOf to build rich and interactive Compose applications.",
        "complexity": "Intermediate",
        "speakers": [
            "796eb17edbb8dcd0f24ffd465235ab05beb57018",
            "289e5c0e7494a73fc56ebc509dfe5aa9a1d564c2",
            "b0a55542e9138934c5395898531fe9394525b04e"
        ]
    },
    "YGC-5550": {
        "title": "Why Projects Succeed: Lessons Learned from the Android OS",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "The story of how Android came to be, and how it managed to survive and thrive in a crowded field of competitors, is an interesting story of people, teams, and vision. But it's also an educational tale of how products can succeed, which can help inform future ideas, startups, companies, acquisitions, and projects throughout tech and business overall.\n\nThis session will draw from the recently published book, Androids: the Team That Built the Android Operating System, to see what we can all learn from the Android project, which started as two people building a camera OS and resulted in a platform running on more than 3 billion devices today.",
        "complexity": "Beginner",
        "speakers": [
            "4a7ca4c16cbe81a612bf3011a3d3439f85408103",
            "379c162aac12eca2deca690287b54ad270cc2e40"
        ]
    },
    "NHE-5712": {
        "title": "L'accessibilité, c'est pas sorcier !",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Le handicap est l'affaire de tous. Il existe sous différentes formes et touche près d'une personne sur cinq. Pourtant la plupart des applications que l'on retrouve sur les stores sont inaccessibles. Fanny, spécialiste de l'accessibilité, et Gérard, vrai touche à tout, vous invite à bord de leur camion laboratoire pour expérimenter les problématiques d'accessibilité les plus courantes et surtout apprendre ensemble à les résoudre. Démonstration, mise en situation, live coding sont au programme. Allez Marcel, en route ! 🚚",
        "complexity": "Beginner",
        "speakers": [
            "2a2a587770ac71e14bdc82a6115575632f3401e0",
            "8fa3cb19406c7ae83ce2695ce8b4dfa75648d074"
        ]
    },
    "LYS-7181": {
        "title": "A talk about talks",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Why is public speaking so great? How did it help my career? Why is it such a good tool to have? How to even get started? And... is it fun? (spoiler- yes!)\n\nThis talk is an intro on the whys and hows of public speaking, what's good about it, how to get started on public speaking with an overview of every step of the way: writing an abstract, applying, writing a talk, giving a talk, and following up. I will share tips from my journey as a public speaker, and from the speaker community, and how I started and gained confidence and leveled up my speaking career.",
        "complexity": "Beginner",
        "speakers": [
            "9c664410ea429bd31e4103fb1eb6e2bbe7b7f34f"
        ]
    },
    "GUH-2562": {
        "title": "Caching your data Graph - Offline & Reactive apps using Apollo Kotlin",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Caching is hard!\n\nIn this talk, we'll look at GraphQL, how it differs from REST and how having a type system for your data can help with caching.\n\nWe'll explore normalized databases, how using them as source of truth keeps your UI state always consistent and make sure state changes are reflected in all your screens.\n\nFinally, we'll put that to practice by looking at how that can be done in the Android Makers app.",
        "complexity": "Intermediate",
        "speakers": [
            "efd0a931724dbd49a6e5b9e6883cc57230a26149",
            "04c52b8f992c37bd782f5ccfc1723d4a4167ae38"
        ]
    },
    "RYM-4193": {
        "title": "Jetpack DataStore - protocol buffers storage solution",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Using Kotlin coroutines & flows, store data asynchronously, in a thread safe and a non blocking way. Curious? DataStore is the new Jetpack data storage library that makes you forget all about SharedPreferences, and allows you to store small amounts of data safely & consistently. In this talk, learn about the two different implementations the library comes with - Proto DataStore & Preference DataStore, differences between the two, use cases of when to use what & the benefits.You will walk away with more confidence to use the modern way of storing data.",
        "complexity": "Beginner",
        "speakers": [
            "fe6c3c11932ad7f6909cb219770c7b331b2d80ed"
        ]
    },
    "CPQ-5361": {
        "title": "Migrer vers Android 12: plus compliqué que de replier une tente 2s",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Une migration pas facile qu'est celle d'Android 12 ! Ce talk vous comptera toutes les subtilités qu'il faut connaître avant de migrer votre application vers Android 12.\n\nDu Manifest aux PendingIntent en passant par les nouvelles restrictions du côté du Bluetooth ou encore au niveau de la sécurité et de la vie privée. Android 12 apporte énormément de changements (et certains bien cachés !) pour les développeurs. Nous explorerons comment s'occuper de la migration vers cette nouvelle version d'Android et quelques tools qui peuvent nous faciliter la tâche.\n\nUne des migrations les plus laborieuses depuis Android 6 et l'introduction des permissions au runtime 😆 3, 2, 1 on replie !",
        "complexity": "Beginner",
        "speakers": [
            "b59333a429b238f81f8c0a6377da8c8f052f917f"
        ]
    },
    "RZH-5525": {
        "title": "To Smartphones and Beyond: Screens Everywhere",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "What does an Android device look like? Perhaps, most people would visualize a Pixel or Samsung smartphone as the answer to the question. But it does not reflect the Android reality today. We can go from watches, smartphones, tablets, foldable devices, chromebooks, TVs, to car displays (Android Auto). The list of devices rendering Android apps becomes bigger and bigger. So does our way of implementing an Android screen still make sense?\n\nIn this presentation we would like to share with you our vision at Disney Streaming of what’s an Android device and how we find / live / resolve issues about the Android devices range.",
        "complexity": "Beginner",
        "speakers": [
            "fb805760b311d7dea7963afcd97f9613303f7722",
            "9cca77d49733a147693723113dfd3cc90da2cb32"
        ]
    },
    "XDP-9037": {
        "title": "Architecture, to build an app, or a house, it's important. But what is that concretely?",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "MVVM, MVP, Clean Architecture, Baroque, Multitier, you hear those words at every conference, at work, or anywhere else, but maybe you don't really know what it is? Or you are not sure why you should you a certain type of Architecture instead of another?\n\nIn this talk, I want to give you all the tools to know about architecture and I want to show you an overview of the most commun type of architectures we are using in the mobile world.",
        "complexity": "Beginner",
        "speakers": [
            "ab12cba820c3cdd5f9ac0dd86acc8be4360308bd"
        ]
    },
    "SFM-4681": {
        "title": "The definitive guide to Android library development",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Android library/SDK development unfortunately is harder than it should be. This is caused by inferior tooling (Why do you need fat AAR?), missing documentation (What causes transitive dependency conflicts?), and different architecture considerations (Should you modularize your SDK?).\n\nHaving switched to full-time Android SDK development two years ago, I'm summarizing my lessons learned into a talk I wish would have existed when I got started.\n\n⚠️ This talk is aimed at anyone curious to level up their knowledge of the Android ecosystem, not just at beginning/seasoned SDK developers!",
        "complexity": "Intermediate",
        "speakers": [
            "1e8ee9b62ccbf4142710dbe7fde7bac48d1b5c96"
        ]
    },
    "FTE-5493": {
        "title": "The untold guide for making PoCs",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "In the era of Jetpack Compose, KMM, and an arsenal of new Android frameworks, libraries and architectures, it's more than important to be able to evaluate new technologies correctly. PoC (Proof of Concept) projects are usually used for this purpose, but little to no guides are available on how to do an effective PoC. This talk will be that missing guide !",
        "complexity": "Beginner",
        "speakers": [
            "871b279eaaf5863eb98307a1254815fadf6ac8b8"
        ]
    },
    "GUU-0892": {
        "title": "How to get satisfaction from ungrateful work: A journey into updating Kotlin",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "When working on a new project or joining a mid/big project, you’ll have at some point to update the libraries. Adding or upgrading a library to a newer version seems an easy task. After all most of the time it's \"just\" updating a number. But in reality it can cause a number of (sometimes) \"invisible\" failures that require you to approach this upgrade carefully. In this presentation we will show easy steps to prevent these failures and spot the errors.",
        "complexity": "Beginner",
        "speakers": [
            "7efc198c67dc2f4c71df042e3a7e7d16c601c976"
        ]
    },
    "OUC-8969": {
        "title": "Practical Advanced Kotlin in Practice",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Getting started with Kotlin is as easy as saying “I want null safety” or \"I hate boilerplate\", sure — but that’s only scratching the surface of the brave new world that adopting Kotlin opened up for Java and Android developers.\n\nIn this workshop we’ll look at a number of less known language features and tips to make the most of the Kotlin Programming Language™ in our day-to-day work. We’ll touch on several topics, including property delegates, coroutines and flows, callbacks vs function references, sealed classes, member and extension functions, default parameters, typealiases, data classes and destructuring declarations.\n\nFor each of them, we’ll go over a series of dos and don’ts and best practices making sure you get the most out of Kotlin, without falling in the \"shiny new thing\" pitfalls.\n\nNote for attendees: Make sure you have a laptop computer with an up-to-date version of IntelliJ IDEA or Android Studio, with an up-to-date Kotlin plugin, and ideally the latest version of Kotlin and Gradle already in your local caches. We all know how conference Wi-Fi is :)",
        "complexity": "Intermediate",
        "speakers": [
            "4227e79e90c24f18fa5d21d0f583b1ee263216bd"
        ]
    },
    "XEC-3216": {
        "title": "The Future of Design is Still Personal: Reaching Toward True Adaptation",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "The discipline of design has historically produced primarily fixed products. Even the term \"product\" implies the end of a process, or something that is completed and unchanging. But we know that the intent of the designer and of the person experiencing the design are engaged in an ongoing conversation.\n\nDigital products have drastically increased the pace of that conversation, introducing faster iteration, new modes of interaction, and – importantly – space to imagine a future in which a person's intent directly defines their experience of digital interfaces.\n\nThis session will connect historic explorations of adaptable design with contemporary developments, including Google's Material Design, looking toward a truly adaptive future that accounts for more devices and more people in more contexts.",
        "complexity": "Beginner",
        "speakers": [
            "261f7a484edbadf864016e371f31f749475178d6"
        ]
    },
    "JAD-6398": {
        "title": "Improve Build Times in Less Time",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Build times are never as fast as we want but there is a lot you can do to improve them today without being a Gradle domain expert or buying everyone new computers! In this talk we'll cover a number of different tools, patterns, and common pitfalls to avoid for improving your build times quickly and take your (team's) developer productivity to the next level.",
        "complexity": "Intermediate",
        "speakers": [
            "81475c5c7df6a5dbd02305f38a07737bb040ff47"
        ]
    },
    "ZKC-6000": {
        "title": "Where and how to run UI tests?",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "UI tests have never been easy. Yes, with frameworks like Kaspresso and Kakao it gets easier year by year.\n\nHowever, running ui tests still raises a lot of questions, like: - Which test runner do I need to use? - How to deal with unstable network? - Emulator or Real Device? - How to clear the state and why? - How to make tests less flakiness? - How to organise good reports?\n\nWe gonna talk about all of these topics and deep dive into test runners, emulators, why adb is not the best option and find the most pragmatic options for your team no matter how big is it.",
        "complexity": "Intermediate",
        "speakers": [
            "3dc83a34a4378294fbabe71ace26dfe955a51b16"
        ]
    },
    "PKX-2607": {
        "title": "Becoming a mentor, why and how?",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "I've been actively mentoring developers in the past few years, in this talk I'd like to go over how I went from a position of being mentored to being the mentor, what mistakes I made along the way and what I learned. We will also respond to the false statement of \"mentoring is a waste of time\" and look at some key points such as:\n- mentoring, not micromanaging\n- creating a safe space where it's okay to make mistake\n- identifying areas that can be improved and coming up with a plan\n- developing a culture around pair programming",
        "complexity": "Intermediate",
        "speakers": [
            "fdec3e91e4892c5b08988aa3f83443e366ed3a1c"
        ]
    },
    "YRV-5644": {
        "title": "Property based testing in practice",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "On paper, everyone agrees that tests are important. And yet, more often than not, tests are neglected. In the rare case where we take the time to write them, more often than not it’s considered a cumbersome task, and given less attention than the \"real code\". This leads to a lot of code smell being written in tests, one of which is using hardcoded values.\n\nTests are often as important, if not more so, as the code that will be published on the Play Store. This workshop will start with describing a productive mindset when writing tests, followed by an in-depth presentation of what Property based testing and Fuzzy testing are, with hands-on exercises to let attendees understand how to apply this concept to any existing Android codebase.",
        "complexity": "Intermediate",
        "speakers": [
            "4be0e0e99b3e04c7154d73ee45444b80d459f466"
        ]
    },
    "NZD-1739": {
        "title": "Inside the .git folder - Explore the mysterious depths...",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Join me as we go on a guided cave diving mission, to map out and understand the mysterious & confusing caverns that lie with the .git folder. The .git folder is a mystifying place that inhabits a dark corner in all of our projects & often remains completely unexplored. We will repel into the abyss and illuminate the files and folders that make up the structures below... Not only that but we will learn more about how git works under the hood by investigating the bizarre formations within the vast cave system...\n\nHave you ever wondered about how Git cleverly stores your changes? Have you ever wondered about those peculiar git plumbing commands? Have you ever wondered about those odd hash string & the objects folder?\n\nOur expedition will provide answers to all these and so much more...\n\nSo no matter what your level of understanding is with git, come along for the adventure of a lifetime, that will guarantee to bring a smile to your face & wisdom to your brain... I only ask that you bring your own harness, helmet & ropes and ensure you sign the safety waiver before arrival...\n\nSee you at Base Camp Git!",
        "complexity": "Beginner",
        "speakers": [
            "24f7fbc170f9551fd4e319336666bcbffb34daa4"
        ]
    },
    "RVJ-5513": {
        "title": "Lazy and amazy - Lazy layouts in Compose",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Jetpack Compose brings a much simpler way to create scrolling layouts than the RecyclerView before it, with fewer lines of code. In this talk, we take a closer look at Lazy layouts in Compose and how this API enables adding content on demand. We will learn about Lazy composables - how and when to use them, how they are built and how they work under the hood, as well as how to change their default implementation to adjust them to your specific design needs. We will also talk about how to optimise for performance with faster scrolling, why you should always provide unique keys, as well as avoid 0-pixel sized items and nesting components scrollable in the same direction. Understanding the low level details of how Lazy works in Compose can set the path for implementing custom Lazy layouts for more complex requirements. We will also take a look at some exciting new features, such as Lazy grids and item animations.",
        "complexity": "Intermediate",
        "speakers": [
            "d0233195e347b6929d84b4f2b3b9cf2084503bff"
        ]
    },
    "IUO-6413": {
        "title": "Develop your CI tools",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Nowadays, setting up a basic unit and syntax testing pipeline for your mobile app has never been easier! That’s a great starting point, but what comes next? We can leverage the CI pipeline to do so much more! Things like automatic code generation and advanced static analysis—all with an aim to ensuring the reliability and performance of your applications.\n\nIn this talk, we’ll take a look at several tools and techniques that you can use to improve your quality of life as a developer, largely by letting the CI do the hard work for you.",
        "complexity": "Intermediate",
        "speakers": [
            "4be0e0e99b3e04c7154d73ee45444b80d459f466"
        ]
    },
    "OWT-6626": {
        "title": "Live-coding a web server with Ktor",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Ktor is a Kotlin framework dedicated to building asynchronous servers and clients in connected systems. In this session, I will explain and demo the core concepts of Ktor 2 by live coding an HTTP server from scratch using Ktor Server. Also, we'll take an overview of Ktor Client, from setting it up to making requests and installing plugins.",
        "complexity": "Beginner",
        "speakers": [
            "f1ccb89c189cf8565f3b9c96ea718f44ef227172"
        ]
    },
    "PXN-5831": {
        "title": ".NET MAUI : Mais c'est quoi ce truc ?",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Le multi-plateforme n'est pas nouveau et les solutions sont légion. Aujourd'hui, la bataille a lieu essentiellement entre React Native et Flutter qui ont chacun des avantages et des inconvénients.\n\nMicrosoft qui a bien Xamarin, a bien compris qu'elle était sur le déclin. En coulisses, ils travaillent sur .NET MAUI leur tout nouveau framework multiplateforme permettant de gérer à la fois Android/iOS et Windows/macOS. Alors que .NET MAUI ne devrait sortir que dans quelques mois, nous nous intéresserons dans ce talk à ce qu'est vraiment cette technologie et ce qu'elle permet de faire.",
        "complexity": "Beginner",
        "speakers": [
            "b514cfad0717c15c7614faa45290699332821266"
        ]
    },
    "SKI-6755": {
        "title": "Implement your own design system with Jetpack Compose",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Feedback on how we are leveraging Compose at Instacart in order to implement our own design system. This brought a lot of ways in which we made the developer experience from figma to code easier, but also some challenges.\nCompose has had a lot of impact on all aspects of our app : design, coding, testing, mentoring, performances and we will look back at all the positives and negative aspects. We will also discuss choosing between implementing your own system from scratch versus customizing Material.",
        "complexity": "Intermediate",
        "speakers": [
            "b8d83561356c738cced6e5ad7075b14744f644bd"
        ]
    },
    "CQY-3449": {
        "title": "Win the hearts of Chrome OS users - How to adapt your Android app",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Android has been supporting pointer/mouse and keyboard inputs from almost day one. But mouses and keyboards have not really been a top priority in the past years, at least for most applications. Recently, a whole new category of devices - Chromebooks - puts these types of input back to the front of the stage. Built-in touchpads and keyboards, or free-form multi-window support are just two examples of what should be taken into account when publishing an Android app with Chromebook users in mind.\n\nDespite the increasing success of Chromebooks, a lot of Android applications are not optimised and provide poor user experiences. The good news is that there are quick and easy actions that we can take to change that in our apps.\n\nIn this session, we will talk about two key points to optimize and improve the user experience and and win the hearts of our users:\n- How to provide more context by adapting the mouse cursor.\n- How to navigate in an application without leaving the keyboard.\nWe will share the tips and tricks we learnt while adapting edjing mix for Chromebooks: https://youtu.be/2pJwC8wdk88",
        "complexity": "Beginner",
        "speakers": [
            "7bac67d7d63904678bd159d5cf29aa842fa30719",
            "502ccdc3af4586ba5aeca6e480c02d43b372a3aa"
        ]
    },
    "BEH-7755": {
        "title": "Android Benchmarking and other stories",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Benchmarking is a topic that will help you to take your app to the next level. Apps face bottlenecks and performance issues as they grow, and often continuing good programming practices will not suffice to keep their behavior on track. Integration of third party APIs, complex access to hardware or just pushing the limits of what Android offers can often lead to a slower and buggier app.\n\nWith a proper benchmark strategy, you will be able to identify and resolve issues on your app before they become too big. This talk showcases the newly released framework from Google, JankStats, and how to use it on a real world app. We will compare it with other already existing Google solutions. As a bonus, we will cover strategies and scenarios where we can integrate our benchmark suits on a CI/CD platform and keep track of regressions and improvements on our app.",
        "complexity": "Intermediate",
        "speakers": [
            "85525b634cb11f3cf25a55f73903a92460b7778e",
            "452bd8feee2751b292fda917b98cef8b242503d6"
        ]
    },
    "AHE-2868": {
        "title": "Exit les scripts, on se créé un plugin Android Studio ?",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Android Studio est un outil que nous utilisons tous les jours. Déjà très fourni en fonctionnalités, il propose en plus la possibilité de les étendre avec un système de plugins qui répondent à certains besoins : parenthèses colorés, génération de code Kotlin à partir d’un fichier JSON, support du langage Dart, etc…\n\nIl y en a beaucoup, mais on a parfois CE besoin spécifique que l’on voudrait automatiser pour un projet, une équipe, voire une entreprise.\n\nBeaucoup par manque de temps ou de connaissances, préfèrent le faire manuellement: le gain de temps ne serait pas si énorme. D’autres plus courageux font cette automatisation via un script : Bash, Python, Java, Kotlin… Moi-même auteur de scripts, j’ai trouvé frustrant de devoir sortir de mon IDE, utiliser un autre outil auquel je dois fournir quelques informations contextuelles. Exemple : mon terminal ne sait pas sur quel fichier je veux exécuter tel ou tel script, je dois lui renseigner manuellement.\n\nJe me suis alors posé plein de questions : Comment intégrer mes scripts dans mon IDE ? Est-ce facile ? Est-ce que ça en vaut le coût ? Dans quel contexte l’automatisation devient intéressante ? Réponses dans ce talk ;)",
        "complexity": "Beginner",
        "speakers": [
            "b4c364ab6ed674a9aacc0b2ec0524ac1cf097578"
        ]
    },
    "NKV-0419": {
        "title": "Managing gRPC with Wire",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "At Cash App, mobile and server engineers collaborate on Protobuf and gRPC schemas to define APIs between their services. To improve our experience doing so, we built Wire. From a small in-house protobuf generation library, Wire has today matured into our favourite tool to manage and generate gRPC messages and services. Wire is backed by a versatile Gradle plugin and is used on our Android app, our iOS app, and our microservices at Cash App.\nThe talk will introduce Wire’s basic features before diving into:\n\n- What Proto 3 support brings to the table in terms of new types and JSON serialisation, and the difference between Wire and protoc,\n- How Wire handles options and provides comfortable APIs to consume them,\n- Details about Wire Gradle plugin internals, what steps are processed and how to configure them,\n- How Wire helps managing protobuf dependencies across microservices.\n\nThis presentation will provide simple entry points for people starting with Wire, and actionable improvements for experienced users alike.",
        "complexity": "Beginner",
        "speakers": [
            "786f4ff40c2d8aeef85a8dc997006cae5a4f9dc3"
        ]
    },
    "DID-9712": {
        "title": "Android Architecture Design with Koin",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Koin (https://insert-koin.io) is a pragmatic dependency injection framework for Kotlin/Android developers, well known for its ease of use. In this session, I propose to see together how we can structure our components, for the following topics:\n\n- Classical Components in MVP, MVVM\n- Dealing with Scopes\n- Jetpack Navigation\n- Jetpack Compose\n- Integrating with Multi Platform\n\nAnd bonus, we will talk about incoming new features .",
        "complexity": "Intermediate",
        "speakers": [
            "6f31d29fa5a6aa10cae357cd9c1125f6018bc9ce"
        ]
    },
    "ADD-2425": {
        "title": "Untangling Coroutine Testing",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Coroutines are embraced on Android as a tool to perform asynchronous operations and manage threading in your apps. Testing them requires some extra work and a solid understanding of scopes and dispatchers. In this talk, we’ll look at how to test coroutines with the latest available testing APIs introduced in kotlinx.coroutines 1.6, from the simplest cases all the way to Flows.",
        "complexity": "Expert",
        "speakers": [
            "5498b37176004d47f01ecb6d61bdead82ff63d9b"
        ]
    },
    "IDH-6371": {
        "title": "Rex - From Dagger to Dagger Hilt",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "During the 2019's Android Dev Summit conference, Google announced that it would stop the development of Dagger-Android and officially recommended to use pure Dagger 2 instead. Few times after those announces Dagger-Hilt was announced and presented as \"a standard way to incorporate Dagger dependency injection into an Android application.\" On the 5th of May 2021 Dagger Hilt 1.0.0 was released.\n\nI recently took the decision to give it a go as Dagger 2 is a powerful but yet difficult tool to understand and setup and did not really want to change the setup it already took me time to master.\n\nWith this talk I'd like to share my experience with Dagger-Hilt with two integration examples:\n\n- From scratch in a new project\n- Refactoring of an important project already using Dagger 2\n\nI will discuss pros and cons of Dagger-Hilt and what does it brings to the table.",
        "complexity": "Intermediate",
        "speakers": [
            "2feb72725774e2b7ae864cafa8d2b6ac6c0cac32"
        ]
    },
    "QLS-6916": {
        "title": "Add a Flutter module to an existing app",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Flutter for Mobile has been stable for more than 3 years. One strategy to introduce this great technology on our current teams is to integrate a module into the existing app. In theory, this task can be done quite easily, but in the real world we have to take into account current development processes: how does the module integrates with the current CI/CD systems? Which architecture and patterns should be followed on the codebase? Which responsibilities should the module have? UI only? UI and some business code? Should it manage its own API calls and local storage? In this talk, I'll walk you through these subjects and how we solved them.\n\n*** this talk will be given remotely ***",
        "complexity": "Beginner",
        "speakers": [
            "109d33decd394492fbd5b99a92dd7607d821d27c"
        ]
    },
    "EST-5335": {
        "title": "The Adventures of Kotlin And Compose Through the Multiplatform World",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Join me in this adventure through Kotlin and Compose Multiplatform and learn how you can develop apps using these technologies. You’ve got your Android app already developed? See how you can make it run on your watch and on the Desktop effortlessly. Or how you can share your business logic with iOS and speed up your development. Perhaps, you want to develop for the Web? See how you can give the first steps into Compose for the Web while also sharing your logic.",
        "complexity": "Intermediate",
        "speakers": [
            "aaec18080e28068c1d725fb7747a77a26df8dcd8"
        ]
    },
    "JWZ-4774": {
        "title": "Life is too short to develop only for Android - A journey to Server-driven UI",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Have you ever had to implement a last minute feature? Did your requirements change? Is your build slow?\n\nServer-driven UI might be the solution to your problems. In this talk, I will discuss how we designed a multi-platform system to build new screens via a simple backend change without having to release new versions of the native apps.\n\nAfter this talk, you will be able to ship features faster on all platforms simultaneously, you will notice that life is too short to develop only for Android.",
        "complexity": "Beginner",
        "speakers": [
            "8cf6953f3044bbd7a00c1da22f5df6b54be26b6f"
        ]
    },
    "DII-9612": {
        "title": "Comment mutualiser du code à l’aide de bibliothèques internes",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Au sein des entreprises tech, le développement de plusieurs applications devient une pratique de plus en plus courante afin d'adresser de nouvelles opportunités. En plus de son application principale, Deezer est également à l'origine de Deezer for Creators, Audiobooks by Deezer, et un SDK pour ses partenaires. D’autres entreprises ont fait de même, comme Uber avec Uber Eats ou Blablacar avec Blablacar Daily.\n\nLes applications Deezer ont de nombreux composants techniques en commun, de l’authentification au Design System, en passant par le player. Chez Deezer, nous partageons ces composants avec des bibliothèques, ce qui nous a amené à réfléchir à:\n- leur contenu,\n- l’extraction de composants dans des bibliothèques,\n- leur organisation (une ou plusieurs bibliothèques, modularisation),\n- la gestion des repo (mono ou multiple) et le versioning,\n- la publication des bibliothèques et leur intégration dans les projets.\nNotre retour d'expérience vous permettra de découvrir différentes solutions, de mieux comprendre les pièges à éviter (dans lesquels nous sommes parfois tombés), et d'évaluer le bénéfice potentiel de l'utilisation de librairies au sein de votre organisation.",
        "complexity": "Intermediate",
        "speakers": [
            "675ce05144893df92af77c3fb33b55065fc15911"
        ]
    },
    "SGC-3820": {
        "title": "Retour d'expérience sur React Native dans Pl@ntNet",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Presque 3 ans après le déploiement de la nouvelle version majeure de PlantNet sous React Native, faisons un point sur les problèmes et avantages d’une application en production avec 30M d’utilisateurs par an sur Android et iOS. ​Il y a beaucoup de désavantages ​à React Native mais est-ce que ça s’équilibre avec les points positifs ?",
        "complexity": "Intermediate",
        "speakers": [
            "11c3eef1aefb87fb11d7beee2a2e4e891604b3e2"
        ]
    },
    "JEA-0128": {
        "title": "Petit guide de mise en place d'une CI pour Android avec Github Actions",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "Dans le processus de développement logiciel, la CI/CD est une pièce cruciale qui aide les équipes à repérer les problèmes le plus tôt possible, améliorer la qualité du code, automatiser les processus de release, entre autres avantages.\n\nDans cette présentation, je ferai un retour d’expérience sur la migration de la CI d'Innovorder vers Github Actions, les défis que nous avons rencontrés et les solutions que nous avons trouvées. Avec un pas à pas de l'implémentation des briques de base de la CI, puis quelques exemples d'améliorations qui peuvent être ajoutées, j'espère vous montrer qu'il peut être très facile de mettre en place une CI sans pour autant avoir de connaissances avancées de DevOps.",
        "complexity": "Beginner",
        "speakers": [
            "7db892d8db121e3c2b47441a73d08b125029431e"
        ]
    },
    "QLZ-2276": {
        "title": "Behind the scene, a dive into the Window Manager",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "The window manager is a strange beast. Only the tip of the iceberg is available as an API to developers, but behind the scene, it directs all the user interface. Let's get into a journey to understand what the 🦭 is going one under the (API) surface.\n\nYou will get a better understanding of the APIs available to you to control your application's window, how to adopt the latest API to support larger screen and foldable devices, and also some of the basics like insets handling and animations, splash screen, edge-to-edge rendering.",
        "complexity": "Intermediate",
        "speakers": [
            "7c3c8d4952ab519203050d818cb1f3d6193ec605",
            "65a10ef193706d1eac513be7fd840171227470ce"
        ]
    },
    "TEB-8393": {
        "title": "Simplifying Scoped Storage with ModernStorage",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "This is an introduction to ModernStorage, a new library unifying storage interactions across all APIs on Android from API 21+, including Scoped Storage, to make file processing a breeze for developers. We’ll go over some of the most common use cases, like uploading a file, listing files from a folder using the Storage Access Framework, getting file metadata, and see how ModernStorage helps you implement them easier.",
        "complexity": "Intermediate",
        "speakers": [
            "e36f716f289dd08cc5c7fdf707c78c11e4b7a7ae"
        ]
    },
    "TWW-8613": {
        "title": "How do YOU compare to others in Mobile DevOps Performance, Productivity, and Maturity?",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Mobile is unique. It provides unique opportunities and presents unique challenges. To take these on, mobile product organizations need to align their teams to work together efficiently and adopt best practices in Mobile DevOps. But it’s difficult to develop a roadmap for improvement without understanding current strengths and weaknesses, and benchmarking Mobile DevOps maturity against similar organizations. Our survey was designed to give mobile teams a way to asses their Mobile DevOps performance, productivity, and maturity, and to give steer on where and how to make improvements.\n\nIn this talk you will learn:\n- What the unique challenges are that the survey was designed to solve\n- How the survey is structured and what it assesses\n- What we have learnt from surveying hundreds of mobile teams about typical performance metrics, processes, and tooling\n- What the stages of Mobile DevOps maturity look like\n- And what you can do to begin the process of becoming Cutting Edge",
        "complexity": "Beginner",
        "speakers": [
            "1618306a9218b5a69ca5a1fa17b1a7ee0ffa7d95"
        ]
    },
    "GWS-5570": {
        "title": "My coroutines patterns and habits, 3 years later",
        "tags": [
            "Android Development"
        ],
        "language": "English",
        "description": "Back in 2019 at Android Makers, I claimed that you could make any codebase more readable with coroutines\n\nSince then, a lot of things happened. Most notably, Google is recommending their use in Android apps, and many AndroidX libraries are now leveraging coroutines, and flows. In the meantime, I also did more coroutines (and flows), and here's a number: more that 1/3 of the functions in a project I worked on for 7 years are suspending functions.\n\nWhy do I use coroutines so much? Any pro-tips? What are the benefits? Are there downsides? How does it look like? Is it readable? Is it maintainable? Is it reliable?\n\nAlso, why are almost 2/3 of the functions I wrote non suspending?\n\nIn this talk, I'll share some examples of substantial usage of coroutines and flows not only in business logic but also in UI, be it with Compose or the View system, I'll share my mental model, and I'll ask you what you think about it.",
        "complexity": "Intermediate",
        "speakers": [
            "cb2e16407c778831b4f990bfbd556135c507867f"
        ]
    },
    "YLE-5245": {
        "title": "Les fuites mémoire sous Android : retour d'expérience et méthodologie",
        "tags": [
            "Android Development"
        ],
        "language": "French",
        "description": "L'un des gros avantages de la JVM est le \"garbage collector\". C'est le processus par lequel les applications Android effectuent une gestion automatique de la mémoire afin que nous n'ayons pas à nous en soucier.\n\nMais est-ce tout à fait vrai ? Que se passerait-il si nous gardions des objets référencés et finissions par empêcher le GC de faire son travail ? C'est ce que nous appelons une fuite de mémoire et cela pourrait non seulement faire \"laguer\" votre application, mais également provoquer des exceptions de type \"OutOfMemoryError\", entraînant une très mauvaise expérience utilisateur.\n\nCette présentation vous donnera des instructions étape par étape pour chasser les fuites mémoire et les corriger à l'aide de LeakCanary et Android Profiler.",
        "complexity": "Intermediate",
        "speakers": [
            "c9a8b648da77430c58904cc76bd0c95cc6d64624"
        ]
    }
}
